app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-10-14 23:40:03.881798"], ["updated_at", "2018-10-14 23:40:03.881798"]]
---
  def create
    @class = SchoolClass.new(school_class_params)
    @class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-10-15 13:51:14.523911"], ["id", 1]]
---
  def update
    @class = SchoolClass.find(params[:id])
    @class.update(school_class_params)