app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-10-15 18:19:04.460701"], ["updated_at", "2018-10-15 18:19:04.460701"]]
---
  def create
    # binding.pry
    @student = Student.new(params.require(:student))
    @student.save